#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>

//二维数组的创建和初始化


//int main()
//{
//	//二维数组的创建
//	//int arr[3][4];
//	//char ch[3][10];
//	
//	//二维数组的初始化
//	
//	//int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//	//int arr[3][4] = { 1,2,3,4,5,6,7 };//不完全初始化 - 后面补0
//	//int arr[3][4] = { {1,2},{3,4},{4,5} };//逐行初始化
//
//	int arr[][4] = { {1,2},{3,4},{4,5} };
//	//行可省略，列不可省略，行数可根据初始化情况确定
//
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ",arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}


//二维数组在内存中的存储

//int main()
//{
//	int arr[][4] = { {1,2},{3,4},{4,5} };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//		printf("&arr[%d][%d] = %p\n",i,j, &arr[i][j]);
//		//二维数组在内存中也是连续存放的
//		//一行内部连续，跨行也是连续的
//		}
//	}
//return 0;
//}


//指针访问

int main()
{
	int arr[][4] = { {1,2},{3,4},{4,5} };
	int i = 0;
	int j = 0;
	int* p = &arr[0][0];
	for (i = 0; i < 12; i++)
	{
		printf("%d ", *p);
		p++;//加一个整型的地址，即4个字节
	}
	return 0;
}



/*arr[0][0]
  arr[0][1]
  arr[0][2]
  arr[0][3]
  看成是以arr[0]为数组名的一维数组
*/


